/**********************************************************************************************************
** Company     : JNE WuHan Co.,Ltd.
** Project     :
** --------------------------------------------------------------------------------------------------------
** File name   : version.h
** Author      : Cai Heng
** Date        : 2021-06-17
** Description : 
**********************************************************************************************************/
#ifndef _VERSION_H_
#define _VERSION_H_

#ifdef __cplusplus
extern "C" {
#endif

/**********************************************************************************************************
**													更新记录
**	-------------------------------------------------------------------------------------------------------
**	Date		|Author		|Description
**	-------------------------------------------------------------------------------------------------------
**	2021-07-23	|Cai Heng	|1) 增加PHYLINK状态检测，避免上电未插网线程序卡死
**				|			|2) bsp_spi.c及bsp_spi.h文件修改
**				|			|3) 添加AD7124及AD7175驱动程序并测试验证
**				|			|4) FLASH及EEPROM驱动程序测试验证
**	------------|-----------|------------------------------------------------------------------------------
**	2021-07-29	|Cai Heng	|1) 新增global.h文件(存放通用变量,如通讯结构体定义)
**				|			|2) 修改app_task_eeprom.c及app_task_eeprom.h文件,使用结构体进行存取操作并完成测试验证
**	------------|-----------|------------------------------------------------------------------------------
**  2021-11-22  |           |1) 新增HC32F4A0STIB芯片的底层驱动
**  2021-12-01  |           |2) 修复AD7124移植的bug
**  2021-12-01  |Huang Cheng|3) 可运行AppTaskLed任务
**  2021-12-02  |           |4) 修复W5500重复初始化SPI的bug，建议不要使用go to语句
**              |           |5) 修复网口断开后重连不上的bug，删除sprintf打印网口信息，修改w5500socket.文件（为适应ringbuffer读写）
**  2021-12-03  |           |6) 修改文件夹目录结构
**              |           |7) 可运行AppTaskLed、AppTaskEth、AppTaskAgeing、AppTaskProtocol任务
**  2021-12-06  |           |8) osTimerStart开启软定时器会导致TimerA运行异常，具体原因待查，内部adc采集放在TimerA_Uint3中处理
**              |           |9) 修复AD7124读取器件ID无CRC校验的bug，读取器件ID返回的数据不带CRC校验数据
**  2021-12-07  |           |10)修复I2C初始化的bug，原因是stcGpioCfg.u16PinOType选成stcGpioCfg.u16PinIType
**  2021-12-08  |           |11)添加ACDC数据处理代码，CAN配置采用将满中断，最多缓冲3帧数据最大可设置8帧
**  2021-12-10  |           |12)修复CAN发送函数的bug：定时器轮询发送时会出现发送STB FIFO满的问题，修改
**              |           |   原来发送方式CAN_STB_TRANS_ONE为CAN_STB_TRANS_ALL即可解决此问题
**              |           |13)当前版本 程序可以跑对充对放流程，数据上抛暂无异常，校准参数设置功能暂未测试
**  2021-12-14  |           |14)校准参数设置查询无问题，该H版控制版拨码开关第1位无法读取，同样程序在F版控制板可正常读取
**              |           |15)该本版软件可正常跑老化程序
**  2021-12-15  |           |16)基于TW5VxxxA-CTR-APP_V2.28更新了应用程序
**  2021-12-17  |           |17)添加bsp_debug串口解析功能
**	------------|-----------|------------------------------------------------------------------------------
**
**	------------|-----------|------------------------------------------------------------------------------
**
**	------------|-----------|------------------------------------------------------------------------------
**
**	------------|-----------|------------------------------------------------------------------------------
**
**********************************************************************************************************/

#ifdef __cplusplus
}
#endif

#endif

/**********************************************************************************************************
**                                          End Of File
**********************************************************************************************************/
