/**********************************************************************************************************
** Company     : JNE WuHan Co.,Ltd.
** Project     :
** --------------------------------------------------------------------------------------------------------
** File name   : bsp_dac80501.h
** Author      : Huang Cheng
** Date        : 2022-01-06
** Description : 
**********************************************************************************************************/

#ifndef _BSP_DAC80501_H_
#define _BSP_DAC80501_H_

#ifdef __cplusplus
extern "C" {
#endif

/**********************************************************************************************************
**                                          头文件引用区
**********************************************************************************************************/
#include <stdint.h>
#include "stm32f429xx.h"

/**********************************************************************************************************
**                                            宏定义区
**********************************************************************************************************/
/* NOOP寄存器 */
#define DAC80501_NOOP               (0x00<<16)         //无需操作寄存器，W
/* DEVID寄存器 */
#define DAC80501_DEVID              (0x01<<16)         //设备ID寄存器，R
/* SYNC寄存器 */
#define DAC80501_SYNC               (0x02<<16)         //同步寄存器，RW
/* CONFIG寄存器 */
#define DAC80501_CONFIG             (0x03<<16)         //配置寄存器，RW
/* GAIN寄存器 */
#define DAC80501_GAIN               (0x04<<16)         //增益寄存器，RW
/* TRIGGER寄存器 */
#define DAC80501_TRIGGER            (0x05<<16)         //触发寄存器，W
/* STATUS寄存器 */
#define DAC80501_STATUS             (0x07<<16)         //状态寄存器，R
/* DAC寄存器 */
#define DAC80501_DAC                (0x08<<16)         //DAC寄存器，RW      

/* DAC80501器件ID */
#define DAC80501M_ID                0x048F       //DAC80501M芯片的ID
/* CONFIG寄存器配置值 */
#define CONFIG_REF_PWDWN            (1<<8)       //配置CONFIG寄存器中的REF_PWDWN位，选择外部参考电压
/* GAIN寄存器配置值 */
#define GAIN_REF_DIV                (0<<8)       //配置GAIN寄存器中的REF_DIV位，电压分压比例为1
#define GAIN_BUFF_GAIN              (1<<0)       //配置GAIN寄存器中的BUFF_GAIN位，输出增益为2
/* TRIGGER寄存器配置值 */
#define TRIGGER_SOFT_RESET          (10<<0)      //配置TRIGGER寄存器中的SOFT_RESET位，设置软件复位
/* DAC寄存器初始设置值 */
#define DAC_DEFDATA_SET             (0x0000)     //配置DAC寄存器的初始化设置值为0，DAC80501M的默认值为8000h


#define DAC80501_CS_NUM             8U
#define DAC_VOL_MAX                 5.0
#define FLAOT_ZERO                  0.00001f
#define RESP_TIME                   5.0             //DAC80501响应时间

/**********************************************************************************************************
**                                           类型定义区
**********************************************************************************************************/
typedef struct
{
	GPIO_TypeDef* CsPort;
	uint16_t Cspin;
}DAC80501_CsType;

/**********************************************************************************************************
**                                         外部引用变量区
**********************************************************************************************************/	
	
	
/**********************************************************************************************************
**                                         外部引用函数区
**********************************************************************************************************/	
void bsp_Dac80501Init(void);
void DAC80501_SetOutVol(uint8_t Dev, uint16_t DacVal);
void DAC80501_SwitchCtrl(uint8_t Dev, uint16_t Nms, uint16_t StepNum, float DacVolMin, float DacVolMax);

#ifdef __cplusplus
}
#endif	
	
#endif

/**********************************************************************************************************
**                                          End Of File
**********************************************************************************************************/
