/**********************************************************************************************************
** Company     : JNE WuHan Co.,Ltd.
** Project     :
** --------------------------------------------------------------------------------------------------------
** File name   : bsp_charge.h
** Author      : Huang Cheng
** Date        : 2022-01-11
** Description : 
**********************************************************************************************************/

#ifndef _BSP_CHARGE_H_
#define _BSP_CHARGE_H_

#ifdef __cplusplus
extern "C" {
#endif

/**********************************************************************************************************
**                                          头文件引用区
**********************************************************************************************************/
#include "main.h"

/**********************************************************************************************************
**                                            宏定义区
**********************************************************************************************************/
#define POWER_MODULE_NUM        0x08u

//控制口标识
#define PORT_NO1				1	
#define PORT_NO2				2	
#define PORT_NO3				3	
#define PORT_NO4				4	
#define PORT_NO5				5	
#define PORT_NO6				6	
#define PORT_NO7				7	
#define PORT_NO8				8	

//系统工作模式
#define SYS_SELFCHECK_MODE		0x22
#define SYS_RETEST_MODE			0x33
#define SYS_AGEING_MODE			0x44
#define SYS_CALIBRATION_MODE	0x55
#define SYS_NORMAL_MODE			0x66

/**********************************************************************************************************
**                                           类型定义区
**********************************************************************************************************/
typedef struct
{
	GPIO_TypeDef* S1_Port;
	uint16_t S1_pin;
}Charge_S1Type;

typedef struct
{
	GPIO_TypeDef* S2_Port;
	uint16_t S2_pin;
}Charge_S2Type;

typedef struct
{
	GPIO_TypeDef* P1_Port;
	uint16_t P1_pin;
}Charge_P1Type;

typedef struct
{
	GPIO_TypeDef* P2_Port;
	uint16_t P2_pin;
}Charge_P2Type;

/**********************************************************************************************************
**                                         外部引用变量区
**********************************************************************************************************/	
extern s_DebugParamStruct debugParam;
	
/**********************************************************************************************************
**                                         外部引用函数区
**********************************************************************************************************/	
void bsp_ChargeInit(void);
void Charge_EnAllModule(void);
void Charge_DisableAllModule(void);
void Charge_EnModule(uint8_t Num);
void Charge_DisableModule(uint8_t Num);
void Charge_BatSwitch(uint8_t Num);

#ifdef __cplusplus
}
#endif	
	
#endif

/**********************************************************************************************************
**                                          End Of File
**********************************************************************************************************/
