/**********************************************************************************************************
** Company     : JNE WuHan Co.,Ltd.
** Project     :
** --------------------------------------------------------------------------------------------------------
** File name   : Bsp_CanLink.h
** Author      : YI LI HUA
** Date        : 2022-07-21
** Description : CAN驱动文件
**********************************************************************************************************/

#ifndef _BSP_CAN_LINK_H_
#define _BSP_CAN_LINK_H_

#ifdef __cplusplus
extern "C" {
#endif

/**********************************************************************************************************
**                                          头文件引用区
**********************************************************************************************************/
#include "main.h"

/**********************************************************************************************************
**                                            宏定义区
**********************************************************************************************************/
#define JN95  			0x01	//JN95
#define JN9B  			0x02	//JN9B
#define JN910_DCDC		0x03	//JN910-DCDC
#define JN910_SWITCH	0x04	//JN910-切换电源
#define TemBox			0x05	//温度采集盒
#define VolBox			0x06	//电压采集盒
	
#define	WIDE			0x00    //广播
#define SPOT			0x01	//点播
	
#define MTOS			0 		//中/上位机->下位机
#define STOM			1		//下位机->中/上位机

#define FILTERSUM		200     //ADC采样过滤次数
	
/**********************************************************************************************************
**                                           类型定义区
**********************************************************************************************************/
//typedef struct
//{
//	uint16_t head;					/* 数据帧头  */
//	uint16_t len;					/* 数据长度  */
//	uint8_t  feat;					/* 特征码    */
//	uint8_t  sta;					/* 状态码    */
//	uint8_t  chEn;					/* 通道标志  */
//	uint16_t crc;					/* CRC校验值 */
//	uint16_t tail;					/* 数据帧尾  */
//}s_ProtocolStruct;

//typedef struct
//{
//	float VmodDebug;
//	float IoutDebug;
//	float VsenseDebug;
//	float TmodDebug;
//	float VtzDebug;
//}s_DebugInqDatStruct1;

typedef struct
{
	float VsenseK;
	float VsenseB;
	float VtzK;
	float VtzB;
}KBRationType;

typedef struct
{
	uint32_t Port;
	uint16_t Pin;
}PortPinType;

/**********************************************************************************************************
**                                         外部引用变量区
**********************************************************************************************************/	


/**********************************************************************************************************
**                                         外部引用函数区
**********************************************************************************************************/
uint8_t CAN1_Send_Msg(uint8_t* Data, uint32_t ID, uint8_t Len);
uint8_t CAN1_Receive_Msg(uint8_t *Data);
void CAN1_Send_Pack(uint8_t* Data, uint16_t Len);
void CAN_Send(void);
void PassSwitch(void);
void SW1SW2ON(void);

extern void CanSendMsg(CAN_HandleTypeDef *hcan, uint8_t *pMsg, uint8_t MsgLen, uint32_t MsgId);
extern uint16_t ErrCnt;

#ifdef __cplusplus
}
#endif

#endif

/**********************************************************************************************************
**                                          End Of File
**********************************************************************************************************/
