/**********************************************************************************************************
** Company     : JNE WuHan Co.,Ltd.
** Project     :
** --------------------------------------------------------------------------------------------------------
** File name   : bsp_protection.h
** Author      : Huang Cheng
** Date        : 2021-11-08
** Description : bsp_protection head file
**********************************************************************************************************/

#ifndef _BSP_PROTECTION_H_
#define _BSP_PROTECTION_H_

#ifdef __cplusplus
extern "C" {
#endif

/**********************************************************************************************************
**                                          头文件引用区
**********************************************************************************************************/
#include <stdint.h>
#include "hc32_ddl.h"

/**********************************************************************************************************
**                                            宏定义区
**********************************************************************************************************/
/********************************************************************************************************	
HW : JN-MPU-C022F 　Hardware fault signal PIN 映射关系
	
		HW fault Input signal Mapping：  
		MG1 	:PG0		MG2		:PF15
		MG3 	:PF14		MG4 	:PF13
		MG5 	:PF12		MG6 	:PF11
		MG7 	:PB1		MG8		:PB0
*硬件错误信号为，硬件检测到错误信号(模块过压、过流、过温、电池反接)输出给MCU ,
*MCU I/0 配置为输入，下拉，故障时候模块输出的是高电平*
	
		
*********************************************************************************************************/
//#define PG8_Pin             GPIO_PIN_10
//#define PG8_GPIO_Port       GPIO_PORT_E

//#define PG7_Pin             GPIO_PIN_09
//#define PG7_GPIO_Port       GPIO_PORT_E

//#define PG6_Pin             GPIO_PIN_08
//#define PG6_GPIO_Port       GPIO_PORT_E

//#define PG5_Pin             GPIO_PIN_07
//#define PG5_GPIO_Port       GPIO_PORT_E

//#define PG4_Pin             GPIO_PIN_06
//#define PG4_GPIO_Port       GPIO_PORT_E

//#define PG3_Pin             GPIO_PIN_05
//#define PG3_GPIO_Port       GPIO_PORT_E

//#define PG2_Pin             GPIO_PIN_04
//#define PG2_GPIO_Port       GPIO_PORT_E

//#define PG1_Pin             GPIO_PIN_03
//#define PG1_GPIO_Port       GPIO_PORT_E

/**********************************************************************************************************
**                                           类型定义区
**********************************************************************************************************/
enum
{
	PG1= 0x00,
	PG2,
	PG3,
	PG4,
	PG5,
	PG6,
	PG7,
	PG8,
	
	PG_MaxNum
};

#pragma pack(1)
typedef struct
{
	uint8_t  GpioPort;
	uint16_t GpioPin;
}PgPortPin_TypeDef;
#pragma pack()

/**********************************************************************************************************
**                                         外部引用变量区
**********************************************************************************************************/	
extern PgPortPin_TypeDef PgPortPinTab[PG_MaxNum];	
	
/**********************************************************************************************************
**                                         外部引用函数区
**********************************************************************************************************/	
void bsp_HW_Fault_InitGPIO(void);
	

#ifdef __cplusplus
}
#endif	
	
#endif

/**********************************************************************************************************
**                                          End Of File
**********************************************************************************************************/
