/**********************************************************************************************************
** Company     : JNE WuHan Co.,Ltd.
** Project     :
** --------------------------------------------------------------------------------------------------------
** File name   : Can_Network_Global.h
** Author      : Cai Heng
** Date        : 2021-01-25
** Description : 
**********************************************************************************************************/

#ifndef _CAN_NETWORK_GLOBAL_H_
#define _CAN_NETWORK_GLOBAL_H_

#ifdef __cplusplus
extern "C" {
#endif
    
/**********************************************************************************************************
**                                          头文件引用区
**********************************************************************************************************/
#include "main.h"

/**********************************************************************************************************
**                                            宏定义区
**********************************************************************************************************/
#define MAX_RX_PACK		16						/* >>>>>> 缓存区最大缓存数据包数 <<<<<< */
#define MAX_RX_FRAME	32						/* >>>>>> 数据包最大缓存数据帧数 <<<<<< */

#define MAX_ERR_INFO	16						/* >>>>>> 故障信息条目最大缓存数 <<<<<< */



/**********************************************************************************************************
**                                           类型定义区
**********************************************************************************************************/
/* 数据类型定义(需要根据实际使用的硬件平台做适配) */
typedef	uint8_t			u8_t;
typedef	int8_t			s8_t;
typedef	uint16_t		u16_t;
typedef	int16_t			s16_t;
typedef	uint32_t		u32_t;
typedef	int32_t			s32_t;
typedef	uint64_t		u64_t;
typedef	int64_t			s64_t;

/* CAN接收数据帧结构体 */
typedef struct
{
	u8_t dat[8];								/* 数据帧 */
}Can_Rx_Frame_Struct;

/* CAN接收数据包结构体 */
typedef struct
{
	u32_t pack_feat_id;							/* 数据包特征ID */
	u8_t max_frame_seq;							/* 最大缓存帧序 */
	u8_t recive_frame_num;						/* 缓存帧数 */
	u8_t target_frame_num;						/* 目标帧数 */
	u8_t tail_frame_len;						/* 尾帧数据长度 */
	u8_t frame_idle_flag[8];					/* 数据帧缓存区空闲标志 */
	u16_t pack_timeout;							/* 数据包接收超时计数器 */
	Can_Rx_Frame_Struct rx_frame[MAX_RX_FRAME];	/* 数据帧缓存区 */
}Can_Rx_Pack_Struct;

/* CAN接收数据缓存结构体 */
typedef struct
{
	Can_Rx_Pack_Struct	rx_pack[MAX_RX_PACK];	/* 数据包缓存区 */
}Can_Rx_Buffer_Struct;


/* 故障信息结构体 */
typedef struct
{
	u8_t sta;
	u32_t id;
	u16_t len;
	u8_t dat[256];
}Err_Info_Struct;

typedef struct
{
	u8_t info_cnt;
	u8_t head_ptr;
	u8_t tail_ptr;
	Err_Info_Struct info[MAX_ERR_INFO];
}Err_Buffer_Struct;



/**********************************************************************************************************
**                                         外部引用变量区
**********************************************************************************************************/	


/**********************************************************************************************************
**                                         外部引用函数区
**********************************************************************************************************/


#ifdef __cplusplus
}
#endif

#endif
