/*
*********************************************************************************************************
*
*	模块名称 : rs485 
*	文件名称 : rs485.h
*	版    本 : V1.0
*	说    明 :
*	修改记录 :
*	版本号  日期         作者       说明
*	V1.0    2020-03-11   ZYL        正式发布
*
*********************************************************************************************************
*/

#ifndef _rs485_H_
#define _rs485_H_

#include "stdint.h"

#define rs485_baud      115200

extern void RS485_Send_OneByte(uint8_t TxByte);
extern void Send_One_MoreByte(uint8_t *TxMoreByte,uint8_t cnt);
extern uint8_t RxBuffer[20];
#endif

/***************************** (END OF FILE) *********************************/
