/**********************************************************************************************************
** Company     : JNE WuHan Co.,Ltd.
** Project     :
** --------------------------------------------------------------------------------------------------------
** File name   : bsp_AD5245.h
** Author      : Huang Cheng
** Date        : 2021-11-09
** Description : 
**********************************************************************************************************/

#ifndef _BSP_AD5245_H_
#define _BSP_AD5245_H_

#ifdef __cplusplus
extern "C" {
#endif

/**********************************************************************************************************
**                                          头文件引用区
**********************************************************************************************************/
#include <stdint.h>
#include "hc32_ddl.h"

/**********************************************************************************************************
**                                            宏定义区
**********************************************************************************************************/
//#define AD5245_TEST

#define AD5245_SCL_GPIO	    GPIO_PORT_H
#define AD5245_SCL_PIN			GPIO_PIN_05		// I2C_SCL : PH5 (Configurable)

#define AD5245_SDA_GPIO	    GPIO_PORT_H
#define AD5245_SDA_PIN			GPIO_PIN_04		// I2C_SDA : PH4 (Configurable)

#define AD5245_SCL_0()  	GPIO_ResetPins(AD5245_SCL_GPIO, AD5245_SCL_PIN)		// SCL = 0
#define AD5245_SCL_1()  	GPIO_SetPins(AD5245_SCL_GPIO, AD5245_SCL_PIN)						// SCL = 1

#define AD5245_SDA_0()  	GPIO_ResetPins(AD5245_SDA_GPIO, AD5245_SDA_PIN)		// SDA = 0
#define AD5245_SDA_1()  	GPIO_SetPins(AD5245_SDA_GPIO, AD5245_SDA_PIN)						// SDA = 1

#define AD5245_SCL_READ()   GPIO_ReadInputPins(AD5245_SCL_GPIO, AD5245_SCL_PIN)				// 读SCL口线状态
#define AD5245_SDA_READ()   GPIO_ReadInputPins(AD5245_SDA_GPIO, AD5245_SDA_PIN)				// 读SDA口线状态										// GPIO速度等级 (Configurable)

/*写从机地址字节点定义*/
#define Write_A0_Add  0x58   //从机地址=0

/*读从机地址字节点定义*/
#define Read_A0_Add  0x59   //从机地址=0

/*指令字节定义*/
#define Normal_SET   0x00   //游标普通设置 
#define RS_SD_SET    0x60   //游标复位，关断
#define RS_SET       0x40   //游标复位
#define SD_SET       0x20   //关断


/**********************************************************************************************************
**                                           类型定义区
**********************************************************************************************************/


/**********************************************************************************************************
**                                         外部引用变量区
**********************************************************************************************************/	
	
	
/**********************************************************************************************************
**                                         外部引用函数区
**********************************************************************************************************/	
void AD5245_Init(void);
int AD5245_Value_Set(uint8_t addr, uint8_t value);
//int AD5245_Vpro_Set(float Vpro);
uint8_t AD5245_Value_Read(uint8_t addr);
void AD5245_Full_RS(uint8_t addr);
void AD5245_Half_RS(uint8_t addr);
void AD5245_SD(uint8_t addr);

#ifdef __cplusplus
}
#endif

#endif

/**********************************************************************************************************
**                                          End Of File
**********************************************************************************************************/
