/**********************************************************************************************************
** Company     : JNE WuHan Co.,Ltd.
** Project     :
** --------------------------------------------------------------------------------------------------------
** File name   : main.h
** Author      : Huang Cheng
** Date        : 2021-11-22
** Description : 
**********************************************************************************************************/

#ifndef _MAIN_H_
#define _MAIN_H_

#ifdef __cplusplus
extern "C" {
#endif

/**********************************************************************************************************
**                                          头文件引用区
**********************************************************************************************************/

/* 标准库头文件 */
#include  <math.h>
#include  <stdarg.h>
#include  <stdio.h>
#include  <stdint.h>
#include  <stdlib.h>
/* 系统库头文件 */


/* 其他库头文件 */
/* 版本说明文件 */
#include "version.h"

/* 驱动层头文件 */
#include "bsp.h"

/* 应用层头文件 */

/**********************************************************************************************************
**                                            类型定义区
**********************************************************************************************************/
typedef  void (*pFunction)(void);   //函数指针
/**********************************************************************************************************
**                                            宏定义区
**********************************************************************************************************/
#ifndef TRUE
#define TRUE						1					//真
#endif

#ifndef FALSE
#define FALSE						0					//假
#endif

#ifndef DISABLE_CFG
#define DISABLE_CFG					0					//失能
#endif

#ifndef ENABLE_CFG
#define ENABLE_CFG					1					//使能
#endif

/* APP打印功能 */
#if (PRINTF_CFG == ENABLE_CFG)
#define APP_Printf				printf
#else
#define APP_Printf(...)
#endif

/* APP_Printf配置 */
#define TASK_ETH_PRINTF_CFG		DISABLE_CFG				//app_task_eth文件串口打印配置 (Configurable)
#define ETH_INIT_PRINTF_CFG		DISABLE_CFG				//ETH_INIT文件串口打印配置     (Configurable)

/* 毫秒级中断函数 */
#define bsp_ProPer1ms  			SysTick_IrqHandler
/* TCPnet任务事件标志 */
#define FLASH_MSG				(1 << 0)
#define EEPROM_MSG				(1 << 1)


/*APP运行区首地址,范围0x20000~0x10FFFF(Sector16~Sector127),大小896KB*/
#define APPLICATION_ADDRESS   EFM_ADDR_SECTOR16

/*升级数据缓存区首地址,范围0x110000~0x1FFFFF(Sector128~Sector239),大小896KB*/
#define UPDATE_ADDRESS        EFM_ADDR_SECTOR128        
/**********************************************************************************************************
**                                           类型定义区
**********************************************************************************************************/


/**********************************************************************************************************
**                                         外部引用变量区
**********************************************************************************************************/	

	
/**********************************************************************************************************
**                                         外部引用函数区
**********************************************************************************************************/	
extern void AppTaskLed(void *argument);
void EFM_FCT_Erase(void);

#ifdef __cplusplus
}
#endif	
	
#endif

/**********************************************************************************************************
**                                          End Of File
**********************************************************************************************************/
